Tekla.Structures.Drawing.PlacingDistanceAttributes
The PlacingDistanceAttributes class contains the basic attributes for placing distances.

Tekla.Structures.Drawing.PlacingDistanceAttributes.SearchMargin
Gets or sets the search marginal for placing.

Tekla.Structures.Drawing.PlacingDistanceAttributes.MinimalDistance
Gets or sets the minimal distance for placing.

Tekla.Structures.Drawing.PlacingDistanceAttributes.MaximalDistance
Gets or sets the maximal distance for placing.

Tekla.Structures.Drawing.PlacingDistanceAttributes.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.PlacingDistanceAttributes class.
The default values are a 0.0 search margin and a 0.0 minimal distance.

Tekla.Structures.Drawing.PlacingDistanceAttributes.#ctor(System.Double,System.Double)
Creates a new placing distance attributes instance with the given search marginal and minimal distance.
searchMargin: The search marginal to be used.
minimalDistance: The minimal distance to be used.

Tekla.Structures.Drawing.PlacingDistanceAttributes.#ctor(System.Double,System.Double,System.Double)
Creates a new placing distance attributes instance with the given search margin, minimal and maximal distance.
searchMargin: The search margin to be used.
minimalDistance: The minimal distance to be used.
maximalDistance: The maximal distance to be used.

Tekla.Structures.Drawing.PlacingDistanceAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.

Tekla.Structures.Drawing.PlacingDistanceAttributes.Clone
Creates a new object that is a copy of the current instance.
Returns:
A new object that is a copy of the current instance.
2